[{"id":"BylsjfrQlm","title":"F-16","memeSrc":"./public/memeStorage/1/SJjofB7x7.jpg","description":"The General Dynamics F-16 Fighting Falcon is a single-engine supersonic multirole fighter aircraft originally developed by General Dynamics (now Lockheed Martin) for the United States Air Force (USAF). Designed as an air superiority day fighter, it evolved into a successful all-weather multirole aircraft. Over 4,500 aircraft have been built since production was approved in 1976.[4] Although no longer being purchased by the U.S. Air Force, improved versions are being built for export customers.[5] In 1993, General Dynamics sold its aircraft manufacturing business to the Lockheed Corporation,[6] which in turn became part of Lockheed Martin after a 1995 merger with Martin Marietta.","privacy":"on","dateStamp":1528152738987},{"id":"r1xGyQrml7","title":"CF-18","memeSrc":"./public/memeStorage/1/SJG1XSXem.jpg","description":"The McDonnell Douglas F/A-18 Hornet is a twin-engine, supersonic, all-weather, carrier-capable, multirole combat jet, designed as both a fighter and attack aircraft (hence the F/A designation). Designed by McDonnell Douglas (now Boeing) and Northrop, the F/A-18 was derived from the latter's YF-17 in the 1970s for use by the United States Navy and Marine Corps. The Hornet is also used by the air forces of several other nations, and since 1986, by the U.S. Navy's Flight Demonstration Squadron, the Blue Angels.","privacy":"on","dateStamp":1528152794476},{"id":"r1x14XSmxQ","title":"B-52","memeSrc":"./public/memeStorage/1/r11E7Sml7.jpg","description":"The Boeing B-52 Stratofortress is an American long-range, subsonic, jet-powered strategic bomber. The B-52 was designed and built by Boeing, which has continued to provide support and upgrades. It has been operated by the United States Air Force (USAF) since the 1950s. The bomber is capable of carrying up to 70,000 pounds (32,000 kg) of weapons,[5] and has a typical combat range of more than 8,800 miles (14,080 km) without aerial refueling.[","privacy":"on","dateStamp":1528152870745},{"id":"ryl4cQHXlm","title":"Rafale","memeSrc":"./public/memeStorage/1/r1Eq7rQx7.jpg","description":"The Dassault Rafale (French pronunciation: ​[ʁafal], literally meaning \"gust of wind\",[9] and \"burst of fire\" in a more military sense)[10] is a French twin-engine, canard delta wing, multirole fighter aircraft designed and built by Dassault Aviation. Equipped with a wide range of weapons, the Rafale is intended to perform air supremacy, interdiction, aerial reconnaissance, ground support, in-depth strike, anti-ship strike and nuclear deterrence missions. The Rafale is referred to as an \"omnirole\" aircraft by Dassault.","privacy":"on","dateStamp":1528152972120},{"id":"Byeqx4BmgQ","title":"Su-35","memeSrc":"./public/memeStorage/1/ry5xVHXeX.jpg","description":"he Sukhoi Su-35 (Russian: Сухой Су-35; NATO reporting name: Flanker-E) is the designation for two improved derivatives of the Su-27 air-defence fighter. They are single-seat, twin-engine, supermaneuverable aircraft, designed by the Sukhoi Design Bureau and built by the Komsomolsk-on-Amur Aircraft Plant.","privacy":"on","dateStamp":1528153074315},{"id":"B1laSNrXxX","title":"Su-27","memeSrc":"./public/memeStorage/2/S1arNBmx7.jpg","description":"The Sukhoi Su-27 (Russian: Сухой Су-27; NATO reporting name: Flanker) is a twin-engine supermaneuverable fighter aircraft designed by Sukhoi. It was intended as a direct competitor for the large United States fourth-generation fighters such as the Grumman F-14 Tomcat and F-15 Eagle, with 3,530-kilometre (1,910 nmi) range, heavy aircraft ordnance, sophisticated avionics and high maneuverability. The Su-27 was designed for air superiority missions, and subsequent variants are able to perform almost all aerial warfare operations. It was designed with the Mikoyan MiG-29 as its complement","dateStamp":1528153157442},{"id":"SyxbiEHmxm","title":"Su-34","memeSrc":"./public/memeStorage/2/HJbiVHXlQ.jpg","description":"The Sukhoi Su-34 (Russian: Сухой Су-34; NATO reporting name: Fullback)[12] is a Russian twin-engine, twin-seat, all-weather supersonic medium-range fighter-bomber/strike aircraft.[1] It first flew in 1990 and entered service in 2014 with the Russian Air Force.[13]\r\n\r\nBased on the Sukhoi Su-27 Flanker air superiority fighter, the Su-34 has an armored cockpit for side-by-side seating of its two-man crew.[14] The Su-34 is designed primarily for tactical deployment against ground and naval targets (tactical bombing/attack/interdiction roles, including against small and mobile targets) on solo and group missions in daytime and at night, under favourable and adverse weather conditions and in a hostile environment with counter-fire and EW counter-measures deployed, as well as for aerial reconnaissance.[1][15][16] The Su-34 will eventually replace the Su-24 tactical strike fighter and the Tu-22M3 long-distance bomber.","privacy":"on","dateStamp":1528153241021},{"id":"BkxMlHBXgm","title":"Mirage-2000","memeSrc":"./public/memeStorage/2/HyGeHrmem.jpg","description":"The Dassault Mirage 2000 is a French multirole, single-engine fourth-generation jet fighter manufactured by Dassault Aviation. It was designed in the late 1970s as a lightweight fighter to replace the Mirage III for the French Air Force (Armée de l'Air). The Mirage 2000 evolved into a multirole aircraft with several variants developed, with sales to a number of nations. It was later developed into the Mirage 2000N and 2000D strike variants, the improved Mirage 2000-5 and several export variants. Over 600 aircraft were built and it has been in service with nine nations.","privacy":"on","dateStamp":1528153321831},{"id":"Bkx9mrHQgQ","title":"F-35","memeSrc":"./public/memeStorage/2/ry9XHBQeX.jpg","description":"The Lockheed Martin F-35 Lightning II is a family of single-seat, single-engine, all-weather stealth multirole fighters. The fifth-generation combat aircraft is designed to perform ground attack and air superiority missions. It has three main models: the F-35A conventional takeoff and landing (CTOL) variant, the F-35B short take-off and vertical-landing (STOVL) variant, and the F-35C carrier-based Catapult Assisted Take-Off But Arrested Recovery (CATOBAR) variant. On 31 July 2015, the United States Marines declared ready for deployment the first squadron of F-35B fighters after intensive testing.[9][10] On 2 August 2016, the U.S. Air Force declared its first squadron of F-35A fighters combat-ready.[","dateStamp":1528153377651}]